/*
* В каждой клетке прямоугольной таблицы
* N × M
* N×M записано некоторое число. Изначально игрок находится в левой верхней клетке.
* За один ход ему разрешается перемещаться в соседнюю клетку либо вправо, либо вниз (влево и вверх перемещаться запрещено).
* При проходе через клетку с игрока берут столько килограммов еды, какое число записано в этой клетке
* (еду берут также за первую и последнюю клетки его пути).
* Требуется найти минимальный вес еды в килограммах, отдав которую игрок может попасть в правый нижний угол.
*
* Ограничения
* Ограничение времени
* 1 с
*
* Ограничение памяти
* 256 МБ
*/

#include <vector>

namespace cheapest_path
{
    uint32_t get_cheapest_path(const std::vector<std::vector<uint32_t>>& matrix);
    void run_tests();
}
